src/Documents/ИзменениеГруппАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеГруппАссортиментаПодразделения</Name>
			<Comment>Изменение групп ассортимента подразделения</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ГруппыАссортиментаПодразделений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВАссортимент</Name>
					<Comment>Дата ввода товар в ассортимент</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыАссортимента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаАссортимента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыАссортимента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Подразделения, для которых устанавливается ассртимент</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Comment>Подразделение компании для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ГруппыАссортиментаПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГруппыАссортиментаПодразделений</Name>
			<Comment>Группы ассортимента подразделений компании</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние товара в ассортименте подразделения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТовараВАссортименте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаАссортимента</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СодержаниеГруппАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СодержаниеГруппАссортимента</Name>
			<Comment>Содержание групп ассортимента</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние товара в ассортименте подразделения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТовараВАссортименте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГруппаАссортимента</Name>
					<Comment>Группа ассортимента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОграничениеАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОграничениеАссортиментаПодразделения</Name>
			<Comment>Ограничение ассортимента подразделения компании</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние товара в ассортименте подразделения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТовараВАссортименте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена номенклатурной позиции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Comment>Процент наценки для автоматического формирования цены продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаРозничная</Name>
					<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БазовыйАссортимент</Name>
					<Comment>Товар вводится в базовый ассортимент</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>итФорматАссортимента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СостоянияТовараВАссортименте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияТовараВАссортименте</Name>
			<Comment>Состояния товара в ассортименте подразделения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Введен</Name>
					<Comment>Введен в ассортимент подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выведен</Name>
					<Comment>Выведен из ассортимента подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
					<Comment>Временно выведен из ассортимента подразделения</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИзменениеАссортиментаПодразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ИзменениеАссортиментаПодразделения</Name>
			<Comment>Изменение ассортимента подразделения</Comment>
			<BasedOn>
				<xr:Item>Document.ИзменениеАссортиментаПодразделения</xr:Item>
				<xr:Item>Catalog.ПрайсЛистыКонтрагентов</xr:Item>
				<xr:Item>Document.ИзменениеСодержанияГруппАссортимента</xr:Item>
				<xr:Item>Document.СогласованиеЗакупочныхЦен</xr:Item>
				<xr:Item>Document.ИзменениеГруппАссортиментаПодразделения</xr:Item>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.ОграничениеАссортиментаПодразделения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип розничных цен списания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВАссортимент</Name>
					<Comment>Дата ввода товара в ассортимент</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеЗакупочныхЦен</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеГруппАссортиментаПодразделения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеСодержанияГруппАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортиментаПодразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>итФормат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыКатегорий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>Списываемые товары</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Comment>Процент наценки для автоматического формирования цены продажи</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничная</Name>
							<Comment>Розничная цена для переоценки остатков перед списанием</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйАссортимент</Name>
							<Comment>Товар вводится в базовый ассортимент</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАссортимента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
					<Comment>Подразделения, для которых устанавливается ассортимент</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Comment>Подразделение компании для которого изменяется ассортимент данным документом</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ИзменениеГруппАссортиментаПодразделения/Ext/ObjectModule.bsl
// Модуль объекта документа "Изменение групп ассортимента подразделения"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//Возвращает документы введенные на основании
Функция ПолучитьДокументыВведенныеНаОсновании()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИзменениеАссортиментаПодразделения.Ссылка,
	|	ИзменениеАссортиментаПодразделения.ПодразделениеКомпании,
	|	ИзменениеАссортиментаПодразделения.ХозОперация
	|ИЗ
	|	Документ.ИзменениеАссортиментаПодразделения КАК ИзменениеАссортиментаПодразделения
	|ГДЕ
	|	ИзменениеАссортиментаПодразделения.ДокументОснование=&Основание";
	Запрос.УстановитьПараметр("Основание", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции //ПолучитьДокументыВведенныеНаОсновании()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ОбработкаЗаполнения()

// Обработчик события заполнения объекта копированием.
//
// Параметры:
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события возникающего при необходимости проверки заполнения реквизитов при записи или при проведении.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПриЗаписи(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

// Обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ПередУдалением(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()

// Обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Отказ - Булево - Признак отказа от совершения операции.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

// Обработчик события возникающего в транзакции записи для формирования движений документу по подчиненным регистрам.
//
// Параметры:
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодразделений = Подразделения.ВыгрузитьКолонку("ПодразделениеКомпании");
	Если МассивПодразделений.Количество() = 0 Тогда
		МассивПодразделений.Добавить(ПодразделениеКомпании);
	КонецЕсли;
	
	//Формируем выборку по таб. части документа
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИзменениеГруппАссортиментаПодразделения.НомерСтроки КАК НомерСтроки,
	|	ИзменениеГруппАссортиментаПодразделения.ГруппаАссортимента КАК ГруппаАссортимента
	|ИЗ
	|	Документ.ИзменениеГруппАссортиментаПодразделения.ГруппыАссортимента КАК ИзменениеГруппАссортиментаПодразделения
	|ГДЕ
	|	ИзменениеГруппАссортиментаПодразделения.Ссылка = &ДокументСсылка");
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекущееПодразделение Из МассивПодразделений Цикл
		Если НЕ (ТекущееПодразделение.РольПодразделения=Справочники.РолиПодразделений.Магазин ИЛИ ТекущееПодразделение.РольПодразделения=Справочники.РолиПодразделений.ПустаяСсылка()) Тогда
			Продолжить;
		КонецЕсли;
		
		ГруппыАссортиментаПодразделений = Движения.ГруппыАссортиментаПодразделений;
		ГруппыАссортиментаПодразделений.ДокументОбъект            = ЭтотОбъект;
		ГруппыАссортиментаПодразделений.ПодразделениеКомпании     = ТекущееПодразделение;
		Если ХозОперация = Справочники.ХозОперации.ДобавлениеГруппыАссортиментаВПодразделение Тогда
			ГруппыАссортиментаПодразделений.ВидДействия = Перечисления.СостоянияТовараВАссортименте.Введен;
		ИначеЕсли ХозОперация=Справочники.ХозОперации.УдалениеГруппыАссортиментаИзПодразделения Тогда
			ГруппыАссортиментаПодразделений.ВидДействия = Перечисления.СостоянияТовараВАссортименте.Выведен;
		Иначе
			ГруппыАссортиментаПодразделений.ВидДействия = Перечисления.СостоянияТовараВАссортименте.Отменен;
		КонецЕсли;
		ГруппыАссортиментаПодразделений.РезультатЗапросаПоГруппам = РезультатЗапроса;
		Отказ = НЕ ГруппыАссортиментаПодразделений.УстановитьГруппыАссортиментаДляПодразделения() ИЛИ Отказ;
	КонецЦикла;
	
	//ДОПОЛНИТЕЛЬНО - НАЧАЛО
	
	тзДокументыНаОсновании = ПолучитьДокументыВведенныеНаОсновании();
	
	//Удалим документы, введенные на основании ранее
	Для Каждого СтрокаДок Из тзДокументыНаОсновании Цикл
		Попытка
			РежимЗаписи = ?(СтрокаДок.Ссылка.Проведен,РежимЗаписиДокумента.ОтменаПроведения,РежимЗаписиДокумента.Запись);
			обДок = СтрокаДок.Ссылка.ПолучитьОбъект();
			обДок.ПометкаУдаления	= Истина;
			обДок.Проведен			= Ложь;
			обДок.Записать(РежимЗаписи);
		Исключение
			Сообщить("Не удалось пометить на удаление документ: " + обДок + ". " + ОписаниеОшибки());
			Отказ = Истина;
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	//3. получаем все группы ассортимента по подразделению из регистра "ГруппыАссортиментаПодразделений"(группы);
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	тзДвижений.ПодразделениеКомпании,
	|	тзДвижений.ГруппаАссортимента,
	|	тзДвижений.Состояние
	|ПОМЕСТИТЬ ДвиженияДокумента
	|ИЗ
	|	&тзДвижений КАК тзДвижений
	|ГДЕ
	|	тзДвижений.ПодразделениеКомпании В (&Подразделения)
	|;
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ПодразделениеКомпании,
	|	ВложенныйЗапрос.ГруппаАссортимента
	|ПОМЕСТИТЬ
	|	ГруппыАссортиментаПодразделений
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияДокумента.ПодразделениеКомпании,
	|		ДвиженияДокумента.ГруппаАссортимента,
	|		ВЫБОР
	|			КОГДА ДвиженияДокумента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен) ТОГДА
	|				1
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ КАК Состояние
	|	ИЗ
	|		ДвиженияДокумента КАК ДвиженияДокумента
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ГруппыАссортиментаПодразделений.ПодразделениеКомпании,
	|		ГруппыАссортиментаПодразделений.ГруппаАссортимента,
	|		1
	|	ИЗ
	|		РегистрСведений.ГруппыАссортиментаПодразделений.СрезПоследних(&Дата, ПодразделениеКомпании В (&Подразделения)) КАК ГруппыАссортиментаПодразделений
	|	ГДЕ
	|		ГруппыАссортиментаПодразделений.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ПодразделениеКомпании,
	|	ВложенныйЗапрос.ГруппаАссортимента
	|ИМЕЮЩИЕ
	|	МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыАссортиментаПодразделений.ГруппаАссортимента
	|ПОМЕСТИТЬ
	|	ГруппыАссортимента
	|ИЗ
	|	ГруппыАссортиментаПодразделений КАК ГруппыАссортиментаПодразделений
	|;
	|
	|ВЫБРАТЬ
	|	ИтоговыйЗапрос.ПодразделениеКомпании,
	|	ИтоговыйЗапрос.Номенклатура,
	|	ИтоговыйЗапрос.Статус КАК Статус
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.ПодразделениеКомпании,
	|		ВложенныйЗапрос.Номенклатура,
	|		МАКСИМУМ(Добавление) КАК Статус
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ГруппыАссортиментаПодразделений.ПодразделениеКомпании,
	|			СодержаниеГруппАссортимента.Номенклатура,
	|			1 КАК Добавление,
	|			0 КАК Удаление
	|		ИЗ
	|			ГруппыАссортиментаПодразделений КАК ГруппыАссортиментаПодразделений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.СодержаниеГруппАссортимента.СрезПоследних(&Дата, ГруппаАссортимента В (ВЫБРАТЬ ГруппаАссортимента ИЗ ГруппыАссортимента)) КАК СодержаниеГруппАссортимента
	|		ПО
	|			СодержаниеГруппАссортимента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен) И 
	|			ГруппыАссортиментаПодразделений.ГруппаАссортимента = СодержаниеГруппАссортимента.ГруппаАссортимента
	|		ГДЕ
	|			СодержаниеГруппАссортимента.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ОграничениеАссортиментаПодразделения.ПодразделениеКомпании,
	|			ОграничениеАссортиментаПодразделения.Номенклатура,
	|			0,
	|			1
	|		ИЗ
	|			РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&Дата, ПодразделениеКомпании В (&Подразделения)) КАК ОграничениеАссортиментаПодразделения
	|		ГДЕ
	|			ОграничениеАссортиментаПодразделения.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)) КАК ВложенныйЗапрос
	|	СГРУППИРОВАТЬ ПО
	|		ВложенныйЗапрос.ПодразделениеКомпании,
	|		ВложенныйЗапрос.Номенклатура
	|	ИМЕЮЩИЕ
	|		МАКСИМУМ(Добавление)<>МАКСИМУМ(Удаление)) КАК ИтоговыйЗапрос
	|УПОРЯДОЧИТЬ ПО
	|	ИтоговыйЗапрос.ПодразделениеКомпании,
	|	ИтоговыйЗапрос.Статус
	|ИТОГИ ПО
	|	ИтоговыйЗапрос.ПодразделениеКомпании,
	|	ИтоговыйЗапрос.Статус
	|";
	
	Запрос.УстановитьПараметр("тзДвижений",    Движения.ГруппыАссортиментаПодразделений.Выгрузить());
	Запрос.УстановитьПараметр("Подразделения", МассивПодразделений);
	Запрос.УстановитьПараметр("Дата",          Дата);
	
	ВыборкаПодразделениеКомпании = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодразделениеКомпании.Следующий() Цикл
		ВыборкаСтатус = ВыборкаПодразделениеКомпании.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтатус.Следующий() Цикл
			
			// Вывод из ассортимента
			Если ВыборкаСтатус.Статус = 0 Тогда
				МассивОснований = тзДокументыНаОсновании.НайтиСтроки(Новый Структура("ПодразделениеКомпании, ХозОперация", ВыборкаСтатус.ПодразделениеКомпании, Справочники.ХозОперации.ВыводТоваровИзАссортимента));
				Если МассивОснований.Количество()>0 Тогда
					ТекСтрокаОсн = МассивОснований[0];
					ДокАссортимента = ТекСтрокаОсн.Ссылка.ПолучитьОбъект();
					тзДокументыНаОсновании.Удалить(ТекСтрокаОсн);
				Иначе
					ДокАссортимента = Документы.ИзменениеАссортиментаПодразделения.СоздатьДокумент();
				КонецЕсли;
			// Ввод в ассортимент
			ИначеЕсли ВыборкаСтатус.Статус = 1 Тогда
				МассивОснований = тзДокументыНаОсновании.НайтиСтроки(Новый Структура("ПодразделениеКомпании, ХозОперация", ВыборкаСтатус.ПодразделениеКомпании, Справочники.ХозОперации.ВводТоваровВАссортимент));
				Если МассивОснований.Количество()>0 Тогда
					ТекСтрокаОсн = МассивОснований[0];
					ДокАссортимента = ТекСтрокаОсн.Ссылка.ПолучитьОбъект();
					тзДокументыНаОсновании.Удалить(ТекСтрокаОсн);
				Иначе
					ДокАссортимента = Документы.ИзменениеАссортиментаПодразделения.СоздатьДокумент();
				КонецЕсли;
			КонецЕсли;
			
			ДокАссортимента.Заполнить(ЭтотОбъект.Ссылка);
			ДокАссортимента.Подразделения.Очистить();
			ДокАссортимента.Товары.Очистить();
			ДокАссортимента.Дата                  = Дата + 1;
			ДокАссортимента.ДатаВводаВАссортимент = ДокАссортимента.Дата;
			ДокАссортимента.ПодразделениеКомпании = ВыборкаСтатус.ПодразделениеКомпании;
			
			Если ВыборкаСтатус.Статус = 0 Тогда
				ДокАссортимента.ХозОперация = Справочники.ХозОперации.ВыводТоваровИзАссортимента;
			Иначе
				ДокАссортимента.ХозОперация = Справочники.ХозОперации.ВводТоваровВАссортимент;
			КонецЕсли;
			
			Выборка = ВыборкаСтатус.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ДокАссортимента.Товары.Добавить();
				НоваяСтрока.Номенклатура = Выборка.Номенклатура;
				Документы.ИзменениеАссортиментаПодразделения.ТоварыНоменклатураПриИзменении(ДокАссортимента, НоваяСтрока);
			КонецЦикла;
			
			ДокАссортимента.ПометкаУдаления	= Ложь;
			ДокАссортимента.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
	КонецЦикла;
	
	////Удалим лишние документы, введенные на основании ранее
	//Для Каждого СтрокаДок Из тзДокументыНаОсновании Цикл
	//	Попытка
	//		РежимЗаписи = ?(СтрокаДок.Проведен,РежимЗаписиДокумента.ОтменаПроведения,РежимЗаписиДокумента.Запись);
	//		обДок = СтрокаДок.Ссылка.ПолучитьОбъект();
	//		обДок.ПометкаУдаления	= Истина;
	//		обДок.Проведен			= Ложь;
	//		обДок.Записать(РежимЗаписи);
	//	Исключение
	//		Сообщить("Не удалось пометить на удаление документ: " + обДок + ". " + ОписаниеОшибки());
	//		Отказ = Истина;
	//		Прервать;
	//	КонецПопытки;
	//КонецЦикла;
	
КонецПроцедуры // ОбработкаПроведения()

#КонецЕсли
